#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/a4875d71-620d-433a-bf77-690758def15d/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.prod_web will be created
  + resource "aws_autoscaling_attachment" "prod_web" {
      + autoscaling_group_name = (known after apply)
      + elb                    = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.prod_web will be created
  + resource "aws_autoscaling_group" "prod_web" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-2a",
          + "eu-west-2b",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Terraform"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # aws_default_subnet.default_az1 will be created
  + resource "aws_default_subnet" "default_az1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + existing_default_subnet                        = (known after apply)
      + force_destroy                                  = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Terraform" = "true"
        }
      + tags_all                                       = {
          + "Terraform" = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_default_subnet.default_az2 will be created
  + resource "aws_default_subnet" "default_az2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + existing_default_subnet                        = (known after apply)
      + force_destroy                                  = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Terraform" = "true"
        }
      + tags_all                                       = {
          + "Terraform" = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_default_vpc.default will be created
  + resource "aws_default_vpc" "default" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + existing_default_vpc                 = (known after apply)
      + force_destroy                        = false
      + id                                   = (known after apply)
      + instance_tenancy                     = (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

  # aws_elb.prod_web_elb will be created
  + resource "aws_elb" "prod_web_elb" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "prod-web"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = {
          + "Terraform" = "true"
        }
      + tags_all                    = {
          + "Terraform" = "true"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + target              = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + listener {
          + instance_port     = 80
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_launch_template.prod_web will be created
  + resource "aws_launch_template" "prod_web" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-01ae4488af6c6f65b"
      + instance_type   = "t2.micro"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "prod-web"
      + tags            = {
          + "Terraform" = "true"
        }
      + tags_all        = {
          + "Terraform" = "true"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }
    }

  # aws_s3_bucket.prod_s3_bucket will be created
  + resource "aws_s3_bucket" "prod_s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "stf-tf-course-20211801"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_security_group.prod_web will be created
  + resource "aws_security_group" "prod_web" {
      + arn                    = (known after apply)
      + description            = "Allow Standard HTTP/S ports inbound and all outbound"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "prod_web"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Terraform" = "true"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_autoscaling_attachment.prod_web will be created%0A  + resource "aws_autoscaling_attachment" "prod_web" {%0A      + autoscaling_group_name = (known after apply)%0A      + elb                    = (known after apply)%0A      + id                     = (known after apply)%0A    }%0A%0A  # aws_autoscaling_group.prod_web will be created%0A  + resource "aws_autoscaling_group" "prod_web" {%0A      + arn                       = (known after apply)%0A      + availability_zones        = [%0A          + "eu-west-2a",%0A          + "eu-west-2b",%0A        ]%0A      + default_cooldown          = (known after apply)%0A      + desired_capacity          = 1%0A      + force_delete              = false%0A      + force_delete_warm_pool    = false%0A      + health_check_grace_period = 300%0A      + health_check_type         = (known after apply)%0A      + id                        = (known after apply)%0A      + max_size                  = 1%0A      + metrics_granularity       = "1Minute"%0A      + min_size                  = 1%0A      + name                      = (known after apply)%0A      + name_prefix               = (known after apply)%0A      + protect_from_scale_in     = false%0A      + service_linked_role_arn   = (known after apply)%0A      + vpc_zone_identifier       = (known after apply)%0A      + wait_for_capacity_timeout = "10m"%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + tag {%0A          + key                 = "Terraform"%0A          + propagate_at_launch = true%0A          + value               = "true"%0A        }%0A    }%0A%0A  # aws_default_subnet.default_az1 will be created%0A  + resource "aws_default_subnet" "default_az1" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-2a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = (known after apply)%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + existing_default_subnet                        = (known after apply)%0A      + force_destroy                                  = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block                                = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + outpost_arn                                    = (known after apply)%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all                                       = {%0A          + "Terraform" = "true"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_default_subnet.default_az2 will be created%0A  + resource "aws_default_subnet" "default_az2" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = (known after apply)%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + existing_default_subnet                        = (known after apply)%0A      + force_destroy                                  = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block                                = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + outpost_arn                                    = (known after apply)%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all                                       = {%0A          + "Terraform" = "true"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_default_vpc.default will be created%0A  + resource "aws_default_vpc" "default" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = (known after apply)%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + existing_default_vpc                 = (known after apply)%0A      + force_destroy                        = false%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = (known after apply)%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags_all                             = (known after apply)%0A    }%0A%0A  # aws_elb.prod_web_elb will be created%0A  + resource "aws_elb" "prod_web_elb" {%0A      + arn                         = (known after apply)%0A      + availability_zones          = (known after apply)%0A      + connection_draining         = false%0A      + connection_draining_timeout = 300%0A      + cross_zone_load_balancing   = true%0A      + desync_mitigation_mode      = "defensive"%0A      + dns_name                    = (known after apply)%0A      + id                          = (known after apply)%0A      + idle_timeout                = 60%0A      + instances                   = (known after apply)%0A      + internal                    = (known after apply)%0A      + name                        = "prod-web"%0A      + security_groups             = (known after apply)%0A      + source_security_group       = (known after apply)%0A      + source_security_group_id    = (known after apply)%0A      + subnets                     = (known after apply)%0A      + tags                        = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all                    = {%0A          + "Terraform" = "true"%0A        }%0A      + zone_id                     = (known after apply)%0A%0A      + health_check {%0A          + healthy_threshold   = (known after apply)%0A          + interval            = (known after apply)%0A          + target              = (known after apply)%0A          + timeout             = (known after apply)%0A          + unhealthy_threshold = (known after apply)%0A        }%0A%0A      + listener {%0A          + instance_port     = 80%0A          + instance_protocol = "http"%0A          + lb_port           = 80%0A          + lb_protocol       = "http"%0A        }%0A    }%0A%0A  # aws_launch_template.prod_web will be created%0A  + resource "aws_launch_template" "prod_web" {%0A      + arn             = (known after apply)%0A      + default_version = (known after apply)%0A      + id              = (known after apply)%0A      + image_id        = "ami-01ae4488af6c6f65b"%0A      + instance_type   = "t2.micro"%0A      + latest_version  = (known after apply)%0A      + name            = (known after apply)%0A      + name_prefix     = "prod-web"%0A      + tags            = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all        = {%0A          + "Terraform" = "true"%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A    }%0A%0A  # aws_s3_bucket.prod_s3_bucket will be created%0A  + resource "aws_s3_bucket" "prod_s3_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "stf-tf-course-20211801"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule {%0A          + allowed_headers = (known after apply)%0A          + allowed_methods = (known after apply)%0A          + allowed_origins = (known after apply)%0A          + expose_headers  = (known after apply)%0A          + max_age_seconds = (known after apply)%0A        }%0A%0A      + grant {%0A          + id          = (known after apply)%0A          + permissions = (known after apply)%0A          + type        = (known after apply)%0A          + uri         = (known after apply)%0A        }%0A%0A      + lifecycle_rule {%0A          + abort_incomplete_multipart_upload_days = (known after apply)%0A          + enabled                                = (known after apply)%0A          + id                                     = (known after apply)%0A          + prefix                                 = (known after apply)%0A          + tags                                   = (known after apply)%0A%0A          + expiration {%0A              + date                         = (known after apply)%0A              + days                         = (known after apply)%0A              + expired_object_delete_marker = (known after apply)%0A            }%0A%0A          + noncurrent_version_expiration {%0A              + days = (known after apply)%0A            }%0A%0A          + noncurrent_version_transition {%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A%0A          + transition {%0A              + date          = (known after apply)%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A        }%0A%0A      + logging {%0A          + target_bucket = (known after apply)%0A          + target_prefix = (known after apply)%0A        }%0A%0A      + object_lock_configuration {%0A          + object_lock_enabled = (known after apply)%0A%0A          + rule {%0A              + default_retention {%0A                  + days  = (known after apply)%0A                  + mode  = (known after apply)%0A                  + years = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + replication_configuration {%0A          + role = (known after apply)%0A%0A          + rules {%0A              + delete_marker_replication_status = (known after apply)%0A              + id                               = (known after apply)%0A              + prefix                           = (known after apply)%0A              + priority                         = (known after apply)%0A              + status                           = (known after apply)%0A%0A              + destination {%0A                  + account_id         = (known after apply)%0A                  + bucket             = (known after apply)%0A                  + replica_kms_key_id = (known after apply)%0A                  + storage_class      = (known after apply)%0A%0A                  + access_control_translation {%0A                      + owner = (known after apply)%0A                    }%0A%0A                  + metrics {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A%0A                  + replication_time {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A                }%0A%0A              + filter {%0A                  + prefix = (known after apply)%0A                  + tags   = (known after apply)%0A                }%0A%0A              + source_selection_criteria {%0A                  + sse_kms_encrypted_objects {%0A                      + enabled = (known after apply)%0A                    }%0A                }%0A            }%0A        }%0A%0A      + server_side_encryption_configuration {%0A          + rule {%0A              + bucket_key_enabled = (known after apply)%0A%0A              + apply_server_side_encryption_by_default {%0A                  + kms_master_key_id = (known after apply)%0A                  + sse_algorithm     = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A%0A      + website {%0A          + error_document           = (known after apply)%0A          + index_document           = (known after apply)%0A          + redirect_all_requests_to = (known after apply)%0A          + routing_rules            = (known after apply)%0A        }%0A    }%0A%0A  # aws_security_group.prod_web will be created%0A  + resource "aws_security_group" "prod_web" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow Standard HTTP/S ports inbound and all outbound"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "prod_web"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all               = {%0A          + "Terraform" = "true"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_autoscaling_attachment.prod_web will be created%0A  + resource "aws_autoscaling_attachment" "prod_web" {%0A      + autoscaling_group_name = (known after apply)%0A      + elb                    = (known after apply)%0A      + id                     = (known after apply)%0A    }%0A%0A  # aws_autoscaling_group.prod_web will be created%0A  + resource "aws_autoscaling_group" "prod_web" {%0A      + arn                       = (known after apply)%0A      + availability_zones        = [%0A          + "eu-west-2a",%0A          + "eu-west-2b",%0A        ]%0A      + default_cooldown          = (known after apply)%0A      + desired_capacity          = 1%0A      + force_delete              = false%0A      + force_delete_warm_pool    = false%0A      + health_check_grace_period = 300%0A      + health_check_type         = (known after apply)%0A      + id                        = (known after apply)%0A      + max_size                  = 1%0A      + metrics_granularity       = "1Minute"%0A      + min_size                  = 1%0A      + name                      = (known after apply)%0A      + name_prefix               = (known after apply)%0A      + protect_from_scale_in     = false%0A      + service_linked_role_arn   = (known after apply)%0A      + vpc_zone_identifier       = (known after apply)%0A      + wait_for_capacity_timeout = "10m"%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + tag {%0A          + key                 = "Terraform"%0A          + propagate_at_launch = true%0A          + value               = "true"%0A        }%0A    }%0A%0A  # aws_default_subnet.default_az1 will be created%0A  + resource "aws_default_subnet" "default_az1" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-2a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = (known after apply)%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + existing_default_subnet                        = (known after apply)%0A      + force_destroy                                  = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block                                = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + outpost_arn                                    = (known after apply)%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all                                       = {%0A          + "Terraform" = "true"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_default_subnet.default_az2 will be created%0A  + resource "aws_default_subnet" "default_az2" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = (known after apply)%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + existing_default_subnet                        = (known after apply)%0A      + force_destroy                                  = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block                                = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + outpost_arn                                    = (known after apply)%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all                                       = {%0A          + "Terraform" = "true"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_default_vpc.default will be created%0A  + resource "aws_default_vpc" "default" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = (known after apply)%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + existing_default_vpc                 = (known after apply)%0A      + force_destroy                        = false%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = (known after apply)%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags_all                             = (known after apply)%0A    }%0A%0A  # aws_elb.prod_web_elb will be created%0A  + resource "aws_elb" "prod_web_elb" {%0A      + arn                         = (known after apply)%0A      + availability_zones          = (known after apply)%0A      + connection_draining         = false%0A      + connection_draining_timeout = 300%0A      + cross_zone_load_balancing   = true%0A      + desync_mitigation_mode      = "defensive"%0A      + dns_name                    = (known after apply)%0A      + id                          = (known after apply)%0A      + idle_timeout                = 60%0A      + instances                   = (known after apply)%0A      + internal                    = (known after apply)%0A      + name                        = "prod-web"%0A      + security_groups             = (known after apply)%0A      + source_security_group       = (known after apply)%0A      + source_security_group_id    = (known after apply)%0A      + subnets                     = (known after apply)%0A      + tags                        = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all                    = {%0A          + "Terraform" = "true"%0A        }%0A      + zone_id                     = (known after apply)%0A%0A      + health_check {%0A          + healthy_threshold   = (known after apply)%0A          + interval            = (known after apply)%0A          + target              = (known after apply)%0A          + timeout             = (known after apply)%0A          + unhealthy_threshold = (known after apply)%0A        }%0A%0A      + listener {%0A          + instance_port     = 80%0A          + instance_protocol = "http"%0A          + lb_port           = 80%0A          + lb_protocol       = "http"%0A        }%0A    }%0A%0A  # aws_launch_template.prod_web will be created%0A  + resource "aws_launch_template" "prod_web" {%0A      + arn             = (known after apply)%0A      + default_version = (known after apply)%0A      + id              = (known after apply)%0A      + image_id        = "ami-01ae4488af6c6f65b"%0A      + instance_type   = "t2.micro"%0A      + latest_version  = (known after apply)%0A      + name            = (known after apply)%0A      + name_prefix     = "prod-web"%0A      + tags            = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all        = {%0A          + "Terraform" = "true"%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A    }%0A%0A  # aws_s3_bucket.prod_s3_bucket will be created%0A  + resource "aws_s3_bucket" "prod_s3_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "stf-tf-course-20211801"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule {%0A          + allowed_headers = (known after apply)%0A          + allowed_methods = (known after apply)%0A          + allowed_origins = (known after apply)%0A          + expose_headers  = (known after apply)%0A          + max_age_seconds = (known after apply)%0A        }%0A%0A      + grant {%0A          + id          = (known after apply)%0A          + permissions = (known after apply)%0A          + type        = (known after apply)%0A          + uri         = (known after apply)%0A        }%0A%0A      + lifecycle_rule {%0A          + abort_incomplete_multipart_upload_days = (known after apply)%0A          + enabled                                = (known after apply)%0A          + id                                     = (known after apply)%0A          + prefix                                 = (known after apply)%0A          + tags                                   = (known after apply)%0A%0A          + expiration {%0A              + date                         = (known after apply)%0A              + days                         = (known after apply)%0A              + expired_object_delete_marker = (known after apply)%0A            }%0A%0A          + noncurrent_version_expiration {%0A              + days = (known after apply)%0A            }%0A%0A          + noncurrent_version_transition {%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A%0A          + transition {%0A              + date          = (known after apply)%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A        }%0A%0A      + logging {%0A          + target_bucket = (known after apply)%0A          + target_prefix = (known after apply)%0A        }%0A%0A      + object_lock_configuration {%0A          + object_lock_enabled = (known after apply)%0A%0A          + rule {%0A              + default_retention {%0A                  + days  = (known after apply)%0A                  + mode  = (known after apply)%0A                  + years = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + replication_configuration {%0A          + role = (known after apply)%0A%0A          + rules {%0A              + delete_marker_replication_status = (known after apply)%0A              + id                               = (known after apply)%0A              + prefix                           = (known after apply)%0A              + priority                         = (known after apply)%0A              + status                           = (known after apply)%0A%0A              + destination {%0A                  + account_id         = (known after apply)%0A                  + bucket             = (known after apply)%0A                  + replica_kms_key_id = (known after apply)%0A                  + storage_class      = (known after apply)%0A%0A                  + access_control_translation {%0A                      + owner = (known after apply)%0A                    }%0A%0A                  + metrics {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A%0A                  + replication_time {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A                }%0A%0A              + filter {%0A                  + prefix = (known after apply)%0A                  + tags   = (known after apply)%0A                }%0A%0A              + source_selection_criteria {%0A                  + sse_kms_encrypted_objects {%0A                      + enabled = (known after apply)%0A                    }%0A                }%0A            }%0A        }%0A%0A      + server_side_encryption_configuration {%0A          + rule {%0A              + bucket_key_enabled = (known after apply)%0A%0A              + apply_server_side_encryption_by_default {%0A                  + kms_master_key_id = (known after apply)%0A                  + sse_algorithm     = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A%0A      + website {%0A          + error_document           = (known after apply)%0A          + index_document           = (known after apply)%0A          + redirect_all_requests_to = (known after apply)%0A          + routing_rules            = (known after apply)%0A        }%0A    }%0A%0A  # aws_security_group.prod_web will be created%0A  + resource "aws_security_group" "prod_web" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow Standard HTTP/S ports inbound and all outbound"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "prod_web"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Terraform" = "true"%0A        }%0A      + tags_all               = {%0A          + "Terraform" = "true"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>


*Pusher: @sfasher-slalom, Action: `pull_request`, Working Directory: `/home/runner/work/terraform-github-actions/terraform-github-actions`, Workflow: `CI`*